openfoam2/OpenFOAM-2.3.x/tutorials/incompressible/pimpleDyMFoam/movingCone/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    farFieldMoving
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixedWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    left
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    farField
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
